{
  "name": "Rialto Bridge",
  "pointType": "bridge",
  "category": "bridge",
  "subCategory": "Unique Structures",
  "size": 4,
  "calculationsAnalysis": "The Rialto Bridge represents a unique infrastructure project with both practical and symbolic value. The construction cost of 35,000,000 ducats reflects the engineering challenges and architectural significance, while the income of 150,000 ducats (0.43% return) represents the rental fees from shops built on the bridge. The maintenance cost of 150,000 ducats (100% of income) creates a break-even financial profile appropriate for essential infrastructure with commercial elements. The employment capacity of 30 represents the shop operators and maintenance staff. The construction time of 60 days (5184000000ms) reflects the complex engineering project. This unique building serves as a critical connection between Venice's commercial and governmental districts with appropriate restrictions preventing private construction, reflecting the historical reality of this singular structure that combined infrastructure with commercial space.",
  "shortDescription": "Main bridge spanning the Grand Canal with shops, connecting San Marco and Rialto districts.",
  "fullDescription": "The commercial artery connecting Venice's governmental and financial centers, the Rialto Bridge spans the Grand Canal at its narrowest point. Featuring a single bold stone arch, rows of shops on either side of the central pathway, and distinctive architectural details, this engineering marvel combines practical transportation with commercial opportunity. As a symbol of Venice's commercial prowess and engineering skill, it remains one of the city's most recognizable landmarks.",
  "flavorText": "Some bridges merely connect two shores, but the Rialto connects commerce with governance, tradition with innovation, and engineering with art—all in a single, perfect arch that seems to defy gravity while defining Venice.",
  "constructionCosts": {
    "ducats": 35000000,
    "timber": 4610,
    "bricks": 7680,
    "stone": 23030,
    "marble": 3070
  },
  "maintenanceCost": 15000,
  "productionInformation": {
    "Arti": [],
    "storageCapacity": 150,
    "stores": [],
    "sells": []
  },
  "buildTier": 4,
  "workTier": 0,
  "consumeTier": 0,
  "constructionMinutes": 86400,
  "dailyInfluence": 150
}